config.org
#+TITLE: Grisha's Emacs Config
#+AUTHOR: Grisha Khachaturyan
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

*** TODOS:
**** TODO ADD Table of Contents for this document.
**** TODO ADD general.el package (keybindings package).
**** TODO TRY ergomacs or god-mode or evil mode.
**** TODO TRY [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] mode. video: [[https://youtu.be/VcgjTEa0kU4?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ&t=2495][here]]
*** TODOS: URGENT | For Work
**** DONE Create Shortcut for lsp-find-references
**** DONE Setup Hydra
**** TODO Learn to configure Company Mode
**** DONE Setup Tree-Sitter
**** TODO Customize faces per theme
**** TODO 'C-c c b' command to create comment block


* Emacs Performace

#+begin_src emacs-lisp :tangle ./early-init.el
    ;; Set Garbage collection threshold very high at startup
  (setq gc-cons-threshold (* 50 1000 1000))
  (defvar default-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
#+end_src
Define function to time Emacs startup and determine # of garbage collections
#+begin_src emacs-lisp
  (defun gsh/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))
  (add-hook 'emacs-startup-hook #'gsh/display-startup-time)
#+end_src

* PACKAGE MANAGEMENT
** Setup package.el to work with MELPA.
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives
        '(("melpa" . "https://melpa.org/packages/")
          ("org" . "https://orgmode.org/elpa/")
          ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src

** Installing use-package
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t)
  (setq use-package-always-defer t)
  ;; (setq use-package-verbose t)
#+end_src

* Emacs System configs
#+begin_src emacs-lisp
  ;; Set Dired default directory
  ;; (setq default-directory "C:/Users/GrishaKhachaturyan/hub/")
  ;; set re-builder sytax to string
  (setq reb-re-syntax 'string)
  ;; keep folders clean
  (setq backup-directory-alist
	`(("." . ,(expand-file-name "tmp/backups" user-emacs-directory))))
  ;; create path for auto save mode
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)

  (setq auto-save-list-file-prefix (expand-file-name
				    "tmp/auto-saves/sessions/"
				    user-emacs-directory)
	auto-save-file-name-transforms
	`((".*",(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

  (use-package no-littering
    :demand t)
#+end_src
* MY KEY BINDINGS
** EXITING EMACS
#+begin_src emacs-lisp
  ;; remap save-buffers-kill-terminal from C-x C-c to C-x q
  (if (not (daemonp))
      (global-unset-key (kbd "C-x  C-c"))) ; i always accidentilly press this

  (global-set-key (kbd "C-x q") 'save-buffers-kill-emacs)
#+end_src

** UNMAP ACCIDENTAL KEY PRESSES
#+begin_src emacs-lisp
  (global-unset-key (kbd "C-z"))          ; unmap suspend-frame from C-z
  (global-unset-key (kbd "C-x C-z"))
#+end_src

** SWITCHING VISUAL BUFFERS

#+begin_src emacs-lisp
  ;; switch buffers directionally using ijkl keys similar to right hand wasd
  (global-set-key (kbd "C-c i") 'windmove-up)
  (global-set-key (kbd "C-c k") 'windmove-down)
  (global-set-key (kbd "C-c j") 'windmove-left)
  (global-set-key (kbd "C-c l") 'windmove-right)

  ;; switch buffers directionally using arrow keys
  (global-set-key (kbd "C-c <up>") 'windmove-up)
  (global-set-key (kbd "C-c <down>") 'windmove-down)
  (global-set-key (kbd "C-c <left>") 'windmove-left)
  (global-set-key (kbd "C-c <right>") 'windmove-right)

  ;; add C-c o binding to other-window
  ;; (global-set-key (kbd "C-c o") 'other-window) ; (o)ther

  ;; split buffer with v and h keys
  (global-set-key (kbd "C-c b h") 'split-window-right) ;(h)orizontal
  (global-set-key (kbd "C-c b v") 'split-window-below) ;(v)ertical

  ;; delete other windows
  (global-set-key (kbd "C-c b o") 'delete-other-windows) ; (o)ne window
  (global-set-key (kbd "C-c b c") 'delete-window)        ; (c)lose this window

#+end_src

** SCROLL UP/DOWN LINES WITH: M-j M-k
#+begin_src emacs-lisp
  (global-unset-key (kbd "M-j"))       ; was default-indent-new-line
  (global-unset-key (kbd "M-k"))       ; was kill-sentence
  (global-set-key (kbd "M-j") 'scroll-up-line) ; scroll up
  (global-set-key (kbd "M-k") 'scroll-down-line) ; scroll down
#+end_src

** Whitespace Cleanup on Save
#+begin_src emacs-lisp
  ;; (add-hook 'before-save-hook 'whitespace-cleanup)
#+end_src
** Move half page down with
#+begin_src emacs-lisp
  (defun scroll-up-window-half ()
    "Scroll the buffer window up by half the length of the window."
    (interactive)
    (scroll-up (/ (window-total-height) 2)))
  (defun scroll-down-window-half ()
    "Scroll the buffer window down by half the length of the window."
    (interactive)
    (scroll-down (/ (window-total-height) 2)))

  (global-unset-key (kbd "C-v"))          ; unset default page down key
  (global-unset-key (kbd "M-v"))          ; unset default page up key
  (global-set-key (kbd "C-v") 'scroll-up-window-half)
  (global-set-key (kbd "M-v") 'scroll-down-window-half)
#+end_src

* My Functions
** Easy Insert Underscore (M-SPC)
#+begin_src emacs-lisp
  (global-unset-key (kbd "M-SPC"))
  (defun insert-underscore ()
    "Inserting an underscore '_' character"
    (interactive)
    (insert #x5F))
  (global-set-key (kbd "M-SPC") 'insert-underscore)
#+end_src
* GRAPHICAL USER INTERFACE SETTINGS
Disable Scrollbar.
Show Columns in Modeline.
Display Line Numbers Globaly.
Supress splash screen.
#+begin_src emacs-lisp
  (scroll-bar-mode -1)          ; remove scroll bar
  (column-number-mode)          ; show column number in modline
  ;;(global-display-line-numbers-mode 1) ; enable line numbers in margin globably
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (setq inhibit-startup-message t)     ; No splash screen
  (global-visual-line-mode t)
#+end_src

** COMMENT Set Default Font
Sets font for MacOS X emacs
#+begin_src emacs-lisp
  (set-frame-font "Menlo 14" nil t)
#+end_src

** COMMENT Set Default Font for Windows
#+begin_src emacs-lisp
  (set-frame-font "Consolas-11:bold" nil t)
#+end_src

** set Default Font for Ubuntu
#+begin_src emacs-lisp
  (defun gsh/set-font ()
    (message "Setting font")
    (set-frame-font "Ubuntu Mono-12:bold" nil t))

  (if (daemonp)
      (add-hook 'after-make-frame-functions
                (lambda(frame)
                  (with-selected-frame frame
                    (gsh/set-font))))
    (gsh/set-font))
#+end_src

* COMMENT Beacon (Flash the Cursor)
#+begin_src emacs-lisp
    (use-package beacon
      :config (beacon-mode 1))
#+end_src

* Spaces OVER TABS
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

* Whitespace Butler
#+begin_src emacs-lisp
  (use-package ws-butler
    :hook (prog-mode . ws-butler-mode))
#+end_src
* THEME
# Currently using the Doom [[https://github.com/tomasr/molokai][Molokai]] Theme
Currently using the [[https://monokai.pro/][Doom Monokai-Classic]] theme
:themes_I_like:
 * doom-ir-black (black theme)
 * doom-moonlight
 * doom-outrun-electric
 * doom-fairy-floss (nice light/dark theme)
 * doom-acario-light (good light theme)
 * doom-acario-dark (black theme)
 * doom-pine
 * doom-old-hope
 * wombat
:END:
#+begin_src emacs-lisp
  (use-package doom-themes
    :demand t
    ;; :custom
    ;; (doom-monokai-classic-brighter-comments t)
    ;; (doom-acario-dark-brighter-comments t)
    :config
    (setq doom-themes-enable-bold t     ; if nil, bold is universally disabled
          doom-themes-enable-italic t)  ; if nil, italcs is universally disabled
    ;; (custom-set-variables
     ;; '(doom-molokai-brighter-comments t))
    ;; (load-theme 'doom-monokai-classic t)
    (load-theme 'doom-acario-dark t)

    ;; customize the doom monkai theme
    (custom-set-faces
     '(counsel--mark-ring-highlight ((t (:inherit highlight))))
     ;; '(ivy-current-match ((t (:background "#fd971f" :foreground "black"))))
     '(show-paren-match ((t (:background "#FD971F" :foreground "black"
                                         :weight ultra-bold))))))
#+end_src
** MODE LINE
#+begin_src emacs-lisp
  (use-package doom-modeline
    ;; :demand t
    :init (doom-modeline-mode 1))
#+end_src
** ICONS
#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+end_src
*** Icons dired
#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    ;; :after all-the-icons
    :hook (dired-mode . all-the-icons-dired-mode)
    :config
    (setq all-the-icons-dired-monochrome nil))
#+end_src
 Smart Navigation
These are packages which assist in navigating emacs
* Find Recent Files
#+begin_src emacs-lisp
  ;; (recentf-mode 1)
#+end_src
