init.el
(defun gsh/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))
(add-hook 'emacs-startup-hook #'gsh/display-startup-time)

(require 'package)
(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("org" . "https://orgmode.org/elpa/")
        ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
(setq use-package-always-defer t)
;; (setq use-package-verbose t)

;; Set Dired default directory
(setq default-directory "C:/Users/GrishaKhachaturyan/hub/")
;; set re-builder sytax to string
(setq reb-re-syntax 'string)
;; keep folders clean
(setq backup-directory-alist
      `(("." . ,(expand-file-name "tmp/backups" user-emacs-directory))))
;; create path for auto save mode
(make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)

(setq auto-save-list-file-prefix (expand-file-name
                                  "tmp/auto-saves/sessions/"
                                  user-emacs-directory)
      auto-save-file-name-transforms
      `((".*",(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

(use-package no-littering
  :demand t)

;; remap save-buffers-kill-terminal from C-x C-c to C-x q
(global-unset-key (kbd "C-x  C-c")) ; i always accidentilly press this key
(global-set-key (kbd "C-x q") 'save-buffers-kill-emacs)

(global-unset-key (kbd "C-z"))          ; unmap suspend-frame from C-z
(global-unset-key (kbd "C-x C-z"))

;; switch buffers directionally using ijkl keys similar to right hand wasd
(global-set-key (kbd "C-c i") 'windmove-up)
(global-set-key (kbd "C-c k") 'windmove-down)
(global-set-key (kbd "C-c j") 'windmove-left)
(global-set-key (kbd "C-c l") 'windmove-right)

;; switch buffers directionally using arrow keys
(global-set-key (kbd "C-c <up>") 'windmove-up)
(global-set-key (kbd "C-c <down>") 'windmove-down)
(global-set-key (kbd "C-c <left>") 'windmove-left)
(global-set-key (kbd "C-c <right>") 'windmove-right)

;; add C-c o binding to other-window
;; (global-set-key (kbd "C-c o") 'other-window) ; (o)ther

;; split buffer with v and h keys
(global-set-key (kbd "C-c b h") 'split-window-right) ;(h)orizontal
(global-set-key (kbd "C-c b v") 'split-window-below) ;(v)ertical

;; delete other windows
(global-set-key (kbd "C-c b o") 'delete-other-windows) ; (o)ne window
(global-set-key (kbd "C-c b c") 'delete-window)        ; (c)lose this window

(global-unset-key (kbd "M-j"))       ; was default-indent-new-line
(global-unset-key (kbd "M-k"))       ; was kill-sentence
(global-set-key (kbd "M-j") 'scroll-up-line) ; scroll up
(global-set-key (kbd "M-k") 'scroll-down-line) ; scroll down

;; (add-hook 'before-save-hook 'whitespace-cleanup)

(defun scroll-up-window-half ()
  "Scroll the buffer window up by half the length of the window."
  (interactive)
  (scroll-up (/ (window-total-height) 2)))
(defun scroll-down-window-half ()
  "Scroll the buffer window down by half the length of the window."
  (interactive)
  (scroll-down (/ (window-total-height) 2)))

(global-unset-key (kbd "C-v"))          ; unset default page down key
(global-unset-key (kbd "M-v"))          ; unset default page up key
(global-set-key (kbd "C-v") 'scroll-up-window-half)
(global-set-key (kbd "M-v") 'scroll-down-window-half)

(global-unset-key (kbd "M-SPC"))
(defun insert-underscore ()
  "Inserting an underscore '_' character"
  (interactive)
  (insert #x5F))
(global-set-key (kbd "M-SPC") 'insert-underscore)

(scroll-bar-mode -1)          ; remove scroll bar
(column-number-mode)          ; show column number in modline
;;(global-display-line-numbers-mode 1) ; enable line numbers in margin globably
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(setq inhibit-startup-message t)     ; No splash screen
(global-visual-line-mode t)

(set-frame-font "Consolas-10:bold" nil t)

(setq-default indent-tabs-mode nil)

(use-package ws-butler
  :hook (prog-mode . ws-butler-mode))

(use-package doom-themes
  :demand t
  ;; :custom
  ;; (doom-monokai-classic-brighter-comments t)
  ;; (doom-acario-dark-brighter-comments t)
  :config
  (setq doom-themes-enable-bold t     ; if nil, bold is universally disabled
        doom-themes-enable-italic t)  ; if nil, italcs is universally disabled
  ;; (custom-set-variables
   ;; '(doom-molokai-brighter-comments t))
  ;; (load-theme 'doom-monokai-classic t)
  (load-theme 'doom-acario-dark t)

  ;; customize the doom monkai theme
  (custom-set-faces
   '(counsel--mark-ring-highlight ((t (:inherit highlight))))
   ;; '(ivy-current-match ((t (:background "#fd971f" :foreground "black"))))
   '(show-paren-match ((t (:background "#FD971F" :foreground "black"
                                       :weight ultra-bold))))))

(use-package doom-modeline
  ;; :demand t
  :init (doom-modeline-mode 1))

(use-package all-the-icons
  :if (display-graphic-p))

(use-package all-the-icons-dired
  ;; :after all-the-icons
  :hook (dired-mode . all-the-icons-dired-mode)
  :config
  (setq all-the-icons-dired-monochrome nil))

;; (recentf-mode 1)

(use-package ivy
  ;; :diminish
  :bind (("C-s" . swiper)
         ;; ("C-c C-r" . ivy-resume)
         ;; ("<f6>" . ivy-resume)
         ("M-x" . counsel-M-x)
