config.org
* IVY MODE
Ivy Mode speeds up navigation by perfoming text matching against
possible inputs
#+begin_src emacs-lisp
      (use-package ivy
        ;; :diminish
        :bind (("C-s" . swiper)
               ;; ("C-c C-r" . ivy-resume)
               ;; ("<f6>" . ivy-resume)
               ("M-x" . counsel-M-x)
               ("C-x C-f" . counsel-find-file)
               ("C-x f" . counsel-find-file)
               ("C-c r" . counsel-recentf)    ; open recent file
               ("C-c f" . counsel-recentf)    ; open recent file
               ("C-c C-f" .  counsel-recentf)
               ("C-h d" . counsel-describe-function)
               ("C-h v" . counsel-describe-variable)
               ("C-h o" . counsel-describe-symbol)
               ("C-h l" . counsel-find-library)
               ("C-h i" . counsel-info-lookup-symbol)
               ("C-h u" . counsel-unicode-char)
               ("C-h b" . counsel-descbinds)
               ("C-x b" . counsel-switch-buffer)
               ("C-c t" . counsel-load-theme)
               :map minibuffer-local-map
               ("C-r" . counsel-minibuffer-history)
               ;; ("C-c g" . counsel-git)
               ;; ("C-c j" . counsel-git-grep)
               ;; ("C-c k" . counsel-ag)
               ;; ("C-x l" . counsel-locate)
               ;; ("C-S-o" . counsel-rhythmbox)
               )
        :config
        (ivy-mode 1))
#+end_src
*** Ivy Hydra
#+begin_src emacs-lisp
(use-package ivy-hydra)
#+end_src

*** Ivy Rich
Provides function documentation and key binding info in ivy buffer
#+begin_src emacs-lisp
    (use-package ivy-rich
      :after counsel
      :init
      (ivy-rich-mode 1)
      (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line))

#+end_src

*** All the Icons Ivy Rich
#+begin_src emacs-lisp
  (use-package all-the-icons-ivy-rich
    :after ivy
    :init (all-the-icons-ivy-rich-mode 1))
  #+end_src
** COUNSEL
#+begin_src emacs-lisp
  (use-package counsel
    :config
    (setq ivy-initial-inputs-alist nil))  ; Don't start searches with ^
#+end_src

* Dired
#+begin_src emacs-lisp
    (use-package dired
      :ensure nil
      :commands (dired dired-jump)
      :custom ((dired-listing-switches "-ghoa --group-directories-first"))
      :bind (:map
             dired-mode-map
             ("h" . dired-up-directory)
             ("l" . dired-find-file)
             ("j" . dired-next-line)
             ("k" . dired-previous-line)
             ("J" . dired-goto-file)
             ("K" . kill-current-buffer))
      :config
      ;; (setq insert-directory-program "C:\\Program Files\\Git\\usr\\bin\\ls")
      ;; (setq ls-lisp-use-insert-directory-program t)
  )
#+end_src
* MAGIT (Git Porcelain)
#+begin_src emacs-lisp
    (use-package magit
      :commands magit-status)
#+end_src
* WHICH KEY
Given an initial key sequence Which Key provides hints about the next
possible key presses along with documentation for that key press.
#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :bind
    (("C-c w w" . which-key-show-major-mode)
     ("C-c w i" . which-key-show-minor-mode-keymap))
    :config
    (setq which-key-idle-delay 0.8)
    (which-key-mode))
#+end_src

* Precient
#+begin_src emacs-lisp
  (use-package ivy-prescient
    :after counsel
    :config
    (setq ivy-prescient-retain-classic-highlighting t)
    (prescient-persist-mode)
    (ivy-prescient-mode 1))
#+end_src
* Treemacs
#+begin_src emacs-lisp
    (use-package treemacs
      :defer t
      :custom (treemacs-python-executable "python")
      :config (treemacs-project-follow-mode))
    ;; (use-package treemacs-icons-dired
    ;;   :after dired
    ;;   :config (treemacs-icons-dired-mode))
#+end_src

* Rotate Buffers
#+begin_src emacs-lisp
(use-package rotate)

#+end_src
* Hydra
#+begin_src emacs-lisp
  (use-package hydra
    :bind (("C-x w" . hydra-windows/body)
           ("C-c o" . hydra-other-window/body))
    )
  ;; hydra to condense other window commands
  (defhydra hydra-other-window ()
    "other window commands"
    ("f" find-file-other-window "find file")
    ("b" counsel-switch-buffer-other-window "switch buffer"))
  ;; Hydra for managing buffers
  (defhydra hydra-windows (:hint nil)
    "
  ^Move^       ^Split^           ^Delete^             ^Shift^      ^Misc^
  ^^^^^^^^----------------------------------------------------------------------------------
  _i_: up      _v_: vertical     _o_: other windows   _I_: up      _r_: rotate layout  _g_: refresh
  _k_: down    _h_: horizontal   _d_: this window     _K_: down    _b_: switch buffer
  _j_: left    ^ ^               ^ ^                  _J_: left    _f_: find file
  _l_: right   ^ ^               ^ ^                  _L_: right   _p_: switch project
  "
    ("l" windmove-right)
    ("j" windmove-left)
    ("i" windmove-up)
    ("k" windmove-down)
    ("v" split-window-below)
    ("h" split-window-right)
    ("d" delete-window)
    ("o" delete-other-windows)
    ("I" buf-move-up)
    ("K" buf-move-down)
    ("J" buf-move-left)
    ("L" buf-move-right)
    ("r" rotate-layout)
    ("b" counsel-switch-buffer)
    ("f" counsel-find-file)
    ("p" project-switch-project)
    ("g" revert-buffer-quick)
    ("q" nil "quit"))
#+end_src
* IDE LIKE PACKAGES
Code Completion, Documentaion, Syntax checking, Jump to Definition.
** Language Server Protocol Packages
A Language Server provides: syntax checking, error correction,
and jump to definition functionality for a particular language

*** COMMENT EGLOT (Disabled)
#+begin_src emacs-lisp
  ;; Setup eglot to wordk with clangd-10 (LSP for C/C++)
  ;; (use-package eglot
  ;;   :config
  ;;   (add-to-list 'eglot-server-programs '((c++-mode c-mode) "clangd-10"))
  ;;   (add-hook 'c-mode-hook 'eglot-ensure)
  ;;   (add-hook 'c++-mode-hook 'eglot-ensure))
#+end_src
*** DONE make alias for clangd -> clangd-10

*** LSP MODE (Enabled)
#+begin_src emacs-lisp
  (use-package lsp-mode
    ;; :init
    ;; (setq lsp-keymap-prefix "C-x l")
    :commands (lsp lsp-deferred)
    ;; :init
    ;; (setq lsp-keymap-prefix "C-c l")
    :hook

    (js-mode . lsp-deferred)
    (terraform-mode . lsp-deferred)

    ;; :custom
    ;; ;; (lsp-terraform-server "C:/Users/GrishaKhachaturyan/stand_alone_prgrms/bin/terraform-lsp")
    ;; (lsp-terraform-ls-server
    ;;  "C:/Users/GrishaKhachaturyan/.vscode/extensions/hashicorp.terraform-2.25.1-win32-x64/bin/terraform-ls"
    ;;  )
    :config
    (setq lsp-keymap-prefix "C-x l")
    ;; (setq lsp-disabled-clients '(tfls))
    (lsp-enable-which-key-integration t)
    (setq lsp-diagnostics-provider :none)
    (setq lsp-modeline-diagnostics-enable nil)
    (with-eval-after-load 'lsp-mode
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.env*\\'")))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :config
    ;; (setq lsp-eldoc-enable-hover nil)
    (setq lsp-ui-enable-hover nil)
    (setq lsp-ui-doc-show-with-cursor t)
    (setq lsp-ui-doc-position 'bottom)
    (setq lsp-signature-auto-activate nil)
    (setq lsp-signature-render-documentation nil))
#+end_src

**** Sideline
#+begin_src emacs-lisp
  ;; (use-package sideline
  ;;   :after lsp-mode

  ;;   :init
  ;;   (setq sideline-backends-right '(sideline-lsp)))
#+end_src

** Debuggers

*** DAP-MODE
Dap mode is an emacs interface to the [[https://code.visualstudio.com/api/extension-guides/debugger-extension][Debug Adapter Protocol]]
Instructions/Documentation on configuration files can be found [[https://github.com/llvm/llvm-project/tree/main/lldb/tools/lldb-vscode][here]]
Thread/Session attaching fixed. But dap-mode is still buggy.
It errors out randomly disconnects.
When debugging python dap-mode does not stop at breakpoints. (check back later).
(possible solution is to upgrade debugpy)
[[https://github.com/emacs-lsp/dap-mode/issues/678][This issue]] and [[https://github.com/emacs-lsp/lsp-treemacs/issues/144][this one]] highlight the issue.
:dap_drawer:
#+begin_src emacs-lisp
  (use-package dap-mode
    ;; :ensure t
    :commands dap-debug
    :config
    (require 'dap-ui)
    ;; (dap-auto-configure-mode 1)

    (dap-mode 1)
    (dap-ui-mode 1)
    (dap-tooltip-mode 1)
    (dap-ui-controls-mode 1)

    ;; lldb config
    ;; (setq dap-lldb-debug-program '("/usr/local/opt/llvm/bin/lldb-vscode"))
    ;; (setq dap-lldb-debug-program '("/usr/local/bin/lldb-vscode"))
    (setq dap-print-io t))
#+end_src
:END:

*** Real-GUD
Trying this debugger
#+begin_src emacs-lisp
  (use-package realgud)                   ; RealGUD debugger
#+end_src

** COMPANY MODE (Code Complettion)
COMplete ANYthing: Code completion framework.
#+begin_src emacs-lisp
  (use-package company
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0)
    :hook
    (prog-mode . company-mode)            ; add completion to programming language modes
    ;; (org-mode . company-mode)            ; add completion to org-mode
    )
  ;; :config
  ;; (add-hook 'after-init-hook 'global-company-mode)

  (use-package company-box          ; Show icons in company complettions
    :hook (company-mode . company-box-mode))
#+end_src

** Flycheck (better sytax checker)
Syntax checking and linting.
#+begin_src emacs-lisp
  (use-package flycheck
    :custom
    (flycheck-python-pycompile-executable "python")
    (flycheck-python-pylint-executable "python")
    (flycheck-python-pyright-executable "python")
    (flycheck-python-mypy-executable "python")
    (flycheck-python-flake8-executable "python")
    :config
    ;; (global-flycheck-mode)
    )
#+end_src

** iEdit(edit multiple lines simulatneously)
#+begin_src emacs-lisp
  (use-package iedit)

#+end_src
** Yasnippet
#+begin_src emacs-lisp
  ;; (use-package yasnippet
  ;;   :config (yas-global-mode 1))
#+end_src
