init.el
         ("C-x C-f" . counsel-find-file)
         ("C-x f" . counsel-find-file)
         ("C-c r" . counsel-recentf)    ; open recent file
         ("C-c f" . counsel-recentf)    ; open recent file
         ("C-c C-f" .  counsel-recentf)
         ("C-h d" . counsel-describe-function)
         ("C-h v" . counsel-describe-variable)
         ("C-h o" . counsel-describe-symbol)
         ("C-h l" . counsel-find-library)
         ("C-h i" . counsel-info-lookup-symbol)
         ("C-h u" . counsel-unicode-char)
         ("C-h b" . counsel-descbinds)
         ("C-x b" . counsel-switch-buffer)
         ("C-c t" . counsel-load-theme)
         :map minibuffer-local-map
         ("C-r" . counsel-minibuffer-history)
         ;; ("C-c g" . counsel-git)
         ;; ("C-c j" . counsel-git-grep)
         ;; ("C-c k" . counsel-ag)
         ;; ("C-x l" . counsel-locate)
         ;; ("C-S-o" . counsel-rhythmbox)
         )
  :config
  (ivy-mode 1))

(use-package ivy-hydra)

(use-package ivy-rich
  :after counsel
  :init
  (ivy-rich-mode 1)
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line))

(use-package all-the-icons-ivy-rich
  :after ivy
  :init (all-the-icons-ivy-rich-mode 1))

(use-package counsel
  :config
  (setq ivy-initial-inputs-alist nil))  ; Don't start searches with ^

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :custom ((dired-listing-switches "-ghoa --group-directories-first"))
  :bind (:map
         dired-mode-map
         ("h" . dired-up-directory)
         ("l" . dired-find-file)
         ("j" . dired-next-line)
         ("k" . dired-previous-line)
         ("J" . dired-goto-file)
         ("K" . kill-current-buffer))
  :config
  ;; on windows use git bash ls
  (setq insert-directory-program "C:\\Program Files\\Git\\usr\\bin\\ls")
  (setq ls-lisp-use-insert-directory-program t))

(use-package magit
  :commands magit-status)

(use-package which-key
  :defer 0
  :bind
  (("C-c w w" . which-key-show-major-mode)
   ("C-c w i" . which-key-show-minor-mode-keymap))
  :config
  (setq which-key-idle-delay 0.8)
  (which-key-mode))

(use-package ivy-prescient
  :hook (ivy-mode . ivy-prescient-mode))

(use-package treemacs
  :defer t
  :custom (treemacs-python-executable "python")
  :config (treemacs-project-follow-mode))
;; (use-package treemacs-icons-dired
;;   :after dired
;;   :config (treemacs-icons-dired-mode))

(use-package rotate)

(use-package hydra
  :bind (("C-x w" . hydra-windows/body)
         ("C-c o" . hydra-other-window/body))
  )
;; hydra to condense other window commands
(defhydra hydra-other-window ()
  "other window commands"
  ("f" find-file-other-window "find file")
  ("b" counsel-switch-buffer-other-window "switch buffer"))
;; Hydra for managing buffers
(defhydra hydra-windows (:hint nil)
  "
^Move^       ^Split^           ^Delete^             ^Shift^      ^Misc^
^^^^^^^^----------------------------------------------------------------------------------
_i_: up      _v_: vertical     _o_: other windows   _I_: up      _r_: rotate layout  _g_: refresh
_k_: down    _h_: horizontal   _d_: this window     _K_: down    _b_: switch buffer
_j_: left    ^ ^               ^ ^                  _J_: left    _f_: find file
_l_: right   ^ ^               ^ ^                  _L_: right   _p_: switch project
"
  ("l" windmove-right)
  ("j" windmove-left)
  ("i" windmove-up)
  ("k" windmove-down)
  ("v" split-window-below)
  ("h" split-window-right)
  ("d" delete-window)
  ("o" delete-other-windows)
  ("I" buf-move-up)
  ("K" buf-move-down)
  ("J" buf-move-left)
  ("L" buf-move-right)
  ("r" rotate-layout)
  ("b" counsel-switch-buffer)
  ("f" counsel-find-file)
  ("p" project-switch-project)
  ("g" revert-buffer-quick)
  ("q" nil "quit"))

(use-package lsp-mode
  ;; :init
  ;; (setq lsp-keymap-prefix "C-x l")
  :commands (lsp lsp-deferred)
  ;; :init
  ;; (setq lsp-keymap-prefix "C-c l")
  :hook
  (js-mode . lsp-deferred)
  (terraform-mode . lsp-deferred)

  :custom
  ;; (lsp-terraform-server "C:/Users/GrishaKhachaturyan/stand_alone_prgrms/bin/terraform-lsp")
  (lsp-terraform-ls-server
   "C:/Users/GrishaKhachaturyan/.vscode/extensions/hashicorp.terraform-2.25.1-win32-x64/bin/terraform-ls"
   )
  :init
  (setq lsp-keymap-prefix "C-x l")
  :config
  ;; (setq lsp-disabled-clients '(tfls))
  (lsp-enable-which-key-integration t)
  (setq lsp-diagnostics-provider :none)
  (setq lsp-modeline-diagnostics-enable nil))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :config
  ;; (setq lsp-eldoc-enable-hover nil)
  (setq lsp-ui-enable-hover nil)
  (setq lsp-ui-doc-show-with-cursor t)
  (setq lsp-ui-doc-position 'bottom)
  (setq lsp-signature-auto-activate nil)
  (setq lsp-signature-render-documentation nil))

;; (use-package sideline
;;   :after lsp-mode

;;   :init
;;   (setq sideline-backends-right '(sideline-lsp)))

(use-package dap-mode
  ;; :ensure t
  :commands dap-debug
  :config
  (require 'dap-ui)
  ;; (dap-auto-configure-mode 1)

  (dap-mode 1)
  (dap-ui-mode 1)
  (dap-tooltip-mode 1)
  (dap-ui-controls-mode 1)

  ;; lldb config
  ;; (setq dap-lldb-debug-program '("/usr/local/opt/llvm/bin/lldb-vscode"))
  ;; (setq dap-lldb-debug-program '("/usr/local/bin/lldb-vscode"))
  (setq dap-print-io t))

(use-package realgud)                   ; RealGUD debugger

(use-package company
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0)
  :hook
  (prog-mode . company-mode)            ; add completion to programming language modes
  ;; (org-mode . company-mode)            ; add completion to org-mode
  )
;; :config
;; (add-hook 'after-init-hook 'global-company-mode)

(use-package company-box          ; Show icons in company complettions
  :hook (company-mode . company-box-mode))

(use-package flycheck
  :custom
  (flycheck-python-pycompile-executable "python")
  (flycheck-python-pylint-executable "python")
  (flycheck-python-pyright-executable "python")
  (flycheck-python-mypy-executable "python")
  (flycheck-python-flake8-executable "python")
  :config
  ;; (global-flycheck-mode)
  )

(use-package iedit)

;; (use-package yasnippet
;;   :config (yas-global-mode 1))
