config.org
* Treesitter
#+begin_src emacs-lisp
  (use-package tree-sitter
    :config
    (require 'tree-sitter))

  (use-package tree-sitter-langs
    :config
    (require 'tree-sitter)
    :hook ('python-mode . tree-sitter-hl-mode))
#+end_src
* Programming Languages
** C/C++
#+begin_src emacs-lisp
  (use-package cc
    :ensure nil
    :hook
        (c++-mode . lsp-deferred)
    :config
    (require 'dap-cpptools)
    (require 'dap-lldb)                  ; not stopping at breakpoints. look at upgrading
    (dap-cpptools-setup)

    (dap-register-debug-template
     "cpptools::Run Configuration reverse_string"
     (list :type "cppdbg"
           :request "launch"
           :name "cpptools::Run Configuration"
           :MIMode "gdb"
           :program "${workspaceFolder}/cpp/reverse_string"
           :cwd "${workspaceFolder}/cpp"))
        ;; Debug Configuration for reverse_string.cpp
  (dap-register-debug-template
   "LLDB::Run reverse_string"
   (list :type "lldb-vscode"
         :request "launch"
         :cwd "${workspaceFolder}cpp/"
         :program "${workspaceFolder}cpp/reverse_string"
         :name "LLDB::Run reverse_string")))
#+end_src
** Docker
#+begin_src emacs-lisp
  (use-package dockerfile-mode)
  (use-package docker)
#+end_src
** SuperCollider
*** sclang-extensions (unmaintained package)
Uses AutoComplete which is not as good as Company. Hasn't been updated
for 7 years as of Oct 2022.
#+begin_src emacs-lisp
  ;; (use-package sclang-extensions)
#+end_src

*** COMMENT scel (sclang' mode for emacs)
This is a mode for the sclang language for SuperCollider
#+begin_src emacs-lisp
  (setq exec-path
        (append exec-path
                '("/Applications/SuperCollider.app/Contents/MacOS/")))
  (add-to-list
   'load-path
   "~/Library/Application Support/SuperCollider/downloaded-quarks/scel/el")
  (add-to-list
   'load-path
   "~/.local/share/SuperCollider/downloaded-quarks/scel/el")
  (require 'sclang)
#+end_src

** Python
#+begin_src emacs-lisp
  (use-package python
    :ensure nil
    :custom
    ;; python config
    (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)

    ;; :bind ( :map python-mode-map
    ;;         ("C-c r" . nil))
    :hook
    (python-mode . lsp-deferred)
    :config
    (require 'dap-python)                ; also not stopping at breakpoints. look at upgrading
    ;; (setq py-python-command "python3")
    ;; (setq py-shell-name "python")
    (setq lsp-pylsp-server-command "~/.local/bin/pylsp")
    (setq python-shell-interpreter "python3")
    ;; Debug Configuration for python unittest
    (dap-register-debug-template
     "Python :: Run unittest (buffer)"
     (list :type "python"
           :args ""
           :cwd nil
           :program nil
           :module "unittest"
           :request "launch"
           :name "Python :: Run unittest (buffer)"))
    ;; Debug Configuration for python file which reads from stdin
    (dap-register-debug-template
     "Python :: Run file User Input (buffer)"
     (list :type "python"
           :args ""
           :cwd nil
           :module nil
           :program nil
           :console "integratedTerminal"  ; launches vterm
           :request "launch"
           :name "Python :: Run file User Input (buffer)")))
#+end_src
Was getting encoding errors in run-python buffer on windows
This [[https://emacs.stackexchange.com/questions/31282/unicodeencodeerror-executing-python-in-emacs-not-in-terminal][stackexchange]] answer suggested the following fix
#+begin_src emacs-lisp
  ;; fix run-python codec errors on windows
  (setenv "LANG" "en_US.UTF-8")
  (setenv "PYTHONIOENCODING" "utf-8")
#+end_src
*** Virtual Environemnt
#+begin_src emacs-lisp
  (use-package pyvenv)
#+end_src
** COMMENT Javascript
Install js2-mode
#+begin_src emacs-lisp
  (use-package js2-mode
    :defer t
    :mode "\\.js\\'"
    :config
    (require 'js2-mode)
  )
#+end_src
*** PUG templates for Express framework
#+begin_src emacs-lisp
  (use-package pug-mode)
#+end_src

** Terraform
#+begin_src emacs-lisp
    (use-package terraform-mode
      :defer t)
#+end_src
** COMMENT Yaml
#+begin_src emacs-lisp
  (use-package yaml-mode
    :config
    (require 'yaml-mode)
    (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode)))
#+end_src

* Markdown
#+begin_src emacs-lisp
  (use-package markdown-preview-mode)
#+end_src
* VTERM
A very good shell in emacs
Notes: need to find a way to execute bash profile.
       current way interferes with dap-mode terminal input
#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    ;; :hook
    ;; turn off line numbers in vterm
    ;; (vterm-mode . (lambda () (display-line-numbers-mode 0)))
    ;; execute bash_profile for this terminal session
    ;; :hook
    ;; (vterm-mode . (lambda () (vterm-send-string "source ~/.bash_profile\n")))
    )
#+end_src

* Raindbow Delimiters
Color delimiters like parens and braces according to their depth
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

* COMMENT Projectile (Project Management)
#+begin_src emacs-lisp
  (use-package projectile
    :config (projectile-mode)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/hub")
      (setq projectile-project-search-path
            '("~/hub/new_projects"
              "~/hub/recording_bullet_journal/super_collider_projects")))
    (setq projectile-switch-project-action #'projectile-dired))
#+end_src
* ORG MODE ADDONS & CONFIGS
** Auto-tangle config files
#+begin_src emacs-lisp
  (defun g/org-babel-tangle-config()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.emacs.d/config.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook
                                                #'g/org-babel-tangle-config)))
#+end_src
** Org Customizations
#+begin_src emacs-lisp
  (use-package org
    :defer t
    ;; :after (org-timeline)
    :bind (:map org-mode-map
                ;; ("C-c C-p" . hydra-org/body)
                ;; ("C-c C-n" . hydra-org/body)
                ("M-n" . org-metadown)
                ("M-p" . org-metaup))
    :custom
    (org-priority-highest 65)
    (org-priority-lowest 68)
    (org-priority-default 67)
    :config
    ;; Org Agenda
    (setq org-agenda-span 'day)
    (setq org-agenda-include-diary t)
    ;; Add graphical timeline to org agenda
    (add-hook 'org-agenda-finalize-hook 'org-timeline-insert-timeline :append)
    (setq org-agenda-files
          '("~/hub/ripl/orgs/tickets.org"
            "~/hub/ripl/orgs/my_tasks.org"
            ;; "~/hub/new_projects/orgi/orgi_plan.org"
            ;; "~/hub/recording_bullet_journal/super_collider_projects/sc_bujo.org"
            ;; "~/.emacs.d/config.org"
            ))
    (setq org-todo-keywords
          '((sequence "BACKLOG" "TODO(t)" "NEXT(n)" "RECUR(r)" "TEST(s)" "|" "DONE(d!)")))
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (setq org-startup-indented t)
    (custom-set-faces
     '(org-level-1 ((t (:inherit outline-1 :height 1.20))))
     '(org-level-2 ((t (:inherit outline-2 :height 1.10))))
     '(org-level-3 ((t (:inherit outline-3 :height 1.07))))
     '(org-level-4 ((t (:inherit outline-4 :height 1.05))))
     '(org-level-5 ((t (:inherit outline-5 :height 1.00))))
     )

    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

    (defhydra hydra-org (org-mode-map "C-c")
      "org hydra"
      ("C-n" org-next-visible-heading "next heading")
      ("C-p" org-previous-visible-heading "prev heading")
      ("M-j" org-metadown "move down")
      ("M-k" org-metaup "move up")
      ("q" nil "quit"))
    )
  (use-package org-timeline)
#+end_src

** ORG SUPERSTAR
Adds nice looking bullets to org mode
#+begin_src emacs-lisp
  (use-package org-superstar
    :after org
    :hook (org-mode . org-superstar-mode))
#+end_src

** Org-Roam
Slip Card system for organizing thoughts. Zettelkasten Method
#+begin_src emacs-lisp
  (use-package org-roam
    :custom
    (org-roam-directory "~/hub/org-roam")
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert))
    :config
    (org-roam-setup))
#+end_src

** COMMENT Org-Roam-UI
#+begin_src emacs-lisp
  (use-package org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

** Org Pomodoro
#+begin_src emacs-lisp
  (use-package org-pomodoro
    :after org
    :config
    (setq org-pomodoro-short-break-length 7)
    (setq org-pomodoro-ticking-sound-p nil)
    (setq org-pomodoro-manual-break t))

  ;; The following fixes sounds not working on windows
  (use-package sound-wav)
  (use-package powershell)
  #+end_src
* Helpful (better help documentation)
#+begin_src emacs-lisp
    (use-package helpful
      :custom
      (counsel-describe-function-function #'helpful-callable)
      (counsel-describe-variable-function #'helpful-variable)
      :bind
      (("C-h ." . helpful-at-point)    ; show help docs for current symbol
       ("C-h j" . helpful-at-point)
       ([remap describe-function] . counsel-describe-function)
       ([remap describe-command] . helpful-command)
       ([remap describe-variable] . counsel-describe-variable)
       ([remap describe-key] . helpful-key)
       :map helpful-mode-map
       ("k" . kill-current-buffer)))
#+end_src

* COMMENT w3m (Web Browser for emacs)
Installed this to browse Help documentation for SuperCollider
#+begin_src emacs-lisp
  (use-package w3m)
#+end_src

