init.el

(use-package tree-sitter
  :config
  (require 'tree-sitter))

(use-package tree-sitter-langs
  :config
  (require 'tree-sitter)
  :hook ('python-mode . tree-sitter-hl-mode))

(use-package cc
  :ensure nil
  :hook
      (c++-mode . lsp-deferred)
  :config
  (require 'dap-cpptools)
  (require 'dap-lldb)                  ; not stopping at breakpoints. look at upgrading
  (dap-cpptools-setup)

  (dap-register-debug-template
   "cpptools::Run Configuration reverse_string"
   (list :type "cppdbg"
         :request "launch"
         :name "cpptools::Run Configuration"
         :MIMode "gdb"
         :program "${workspaceFolder}/cpp/reverse_string"
         :cwd "${workspaceFolder}/cpp"))
      ;; Debug Configuration for reverse_string.cpp
(dap-register-debug-template
 "LLDB::Run reverse_string"
 (list :type "lldb-vscode"
       :request "launch"
       :cwd "${workspaceFolder}cpp/"
       :program "${workspaceFolder}cpp/reverse_string"
       :name "LLDB::Run reverse_string")))

(use-package dockerfile-mode)
(use-package docker)

;; (use-package sclang-extensions)

(use-package python
  :ensure nil
  :custom
  ;; python config
  (dap-python-executable "python")
  (dap-python-debugger 'debugpy)

  ;; :bind ( :map python-mode-map
  ;;         ("C-c r" . nil))
  :hook
  (python-mode . lsp-deferred)
  :config
  (require 'dap-python)                ; also not stopping at breakpoints. look at upgrading
  ;; (setq py-python-command "python3")
  ;; (setq py-shell-name "python")
  (setq python-shell-interpreter "python")
  ;; Debug Configuration for python unittest
  (dap-register-debug-template
   "Python :: Run unittest (buffer)"
   (list :type "python"
         :args ""
         :cwd nil
         :program nil
         :module "unittest"
         :request "launch"
         :name "Python :: Run unittest (buffer)"))
  ;; Debug Configuration for python file which reads from stdin
  (dap-register-debug-template
   "Python :: Run file User Input (buffer)"
   (list :type "python"
         :args ""
         :cwd nil
         :module nil
         :program nil
         :console "integratedterminal"  ; launches vterm
         :request "launch"
         :name "Python :: Run file User Input (buffer)")))

;; fix run-python codec errors on windows
(setenv "LANG" "en_US.UTF-8")
(setenv "PYTHONIOENCODING" "utf-8")

(use-package pyvenv)

(use-package terraform-mode
  :defer t)

(use-package markdown-preview-mode)

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(defun g/org-babel-tangle-config()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/config.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook
                                              #'g/org-babel-tangle-config)))

(use-package org
  :defer t
  ;; :after (org-timeline)
  :bind (:map org-mode-map
              ;; ("C-c C-p" . hydra-org/body)
              ;; ("C-c C-n" . hydra-org/body)
              ("M-n" . org-metadown)
              ("M-p" . org-metaup))
  :custom
  (org-priority-highest 65)
  (org-priority-lowest 68)
  (org-priority-default 67)
  :config
  ;; Org Agenda
  (setq org-agenda-span 'day)
  (setq org-agenda-include-diary t)
  ;; Add graphical timeline to org agenda
  (add-hook 'org-agenda-finalize-hook 'org-timeline-insert-timeline :append)
  (setq org-agenda-files
        '("~/hub/ripl/orgs/tickets.org"
          "~/hub/ripl/orgs/my_tasks.org"
          ;; "~/hub/new_projects/orgi/orgi_plan.org"
          ;; "~/hub/recording_bullet_journal/super_collider_projects/sc_bujo.org"
          ;; "~/.emacs.d/config.org"
          ))
  (setq org-todo-keywords
        '((sequence "BACKLOG" "TODO(t)" "NEXT(n)" "RECUR(r)" "TEST(s)" "|" "DONE(d!)")))
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  (setq org-startup-indented t)
  (custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.20))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.10))))
   '(org-level-3 ((t (:inherit outline-3 :height 1.07))))
   '(org-level-4 ((t (:inherit outline-4 :height 1.05))))
   '(org-level-5 ((t (:inherit outline-5 :height 1.00))))
   )

  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

  (defhydra hydra-org (org-mode-map "C-c")
    "org hydra"
    ("C-n" org-next-visible-heading "next heading")
    ("C-p" org-previous-visible-heading "prev heading")
    ("M-j" org-metadown "move down")
    ("M-k" org-metaup "move up")
    ("q" nil "quit"))
  )
(use-package org-timeline)

(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode))

(use-package org-roam
  :custom
  (org-roam-directory "~/hub/org-roam")
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert))
  :config
  (org-roam-setup))

(use-package visual-fill-column
  :hook
  (visual-fill-column-mode . (lambda () (setq visual-fill-column-width 80))))

(use-package org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

(use-package org-pomodoro
    :after org
    :config
    (setq org-pomodoro-short-break-length 7)
    (setq org-pomodoro-ticking-sound-p nil)
    (setq org-pomodoro-manual-break t))

;; The following fixes sounds not working on windows
(use-package sound-wav)
(use-package powershell)

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  (("C-h ." . helpful-at-point)    ; show help docs for current symbol
   ("C-h j" . helpful-at-point)
   ([remap describe-function] . counsel-describe-function)
   ([remap describe-command] . helpful-command)
   ([remap describe-variable] . counsel-describe-variable)
   ([remap describe-key] . helpful-key)
   :map helpful-mode-map
   ("k" . kill-current-buffer)))
