config.org
* Buffer Move
Simplify Swapping buffers
#+begin_src emacs-lisp
  (use-package buffer-move
    :bind (("C-c b l" . buf-move-right)
           ("C-c b j" . buf-move-left)
           ("C-c b i" . buf-move-up)
           ("C-c b k" . buf-move-down)))
#+end_src

* DASHBOARD
#+begin_src emacs-lisp
  (use-package dashboard
    :demand t
    :after (page-break-lines)
    :config
    (setq line-move-visual nil)
    (setq dashboard-startup-banner 'logo)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-center-content nil)
    (setq dashboard-projects-backend 'project-el)
    (setq dashboard-items '((agenda . 6)
                            (projects . 7)
                            (recents . 7)
                            ;; (bookmarks . 3)
                            ))
    (setq dashboard-page-separator "\n\f\n")
    (setq dashboard-agenda-sort-strategy '(time-up))
    (setq dashboard-agenda-time-string-format "%b %d %Y %a ")

    (setq initial-buffer-choice
          (lambda () (get-buffer-create "*dashboard*")))
    (dashboard-setup-startup-hook)
    ;; dashboard icons don't quite load.
    ;; buffer needs to be reverted
    ;; (add-hook 'server-after-make-frame-hook
    ;;           'revert-buffer)
    )

#+end_src

** PAGE BREAK LINES
#+begin_src emacs-lisp
  (use-package page-break-lines
    :demand t
    :config (page-break-lines-mode))
#+End_src

* Save History
#+begin_src emacs-lisp
  (use-package savehist
    :after counsel
    :init
    (savehist-mode 1)
    (setq history-length 25))
#+end_src
* Garbage Collection
#+begin_src emacs-lisp
  ;; Set Garbage collection threshold back down after startup completes
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold (* 2 1000 1000))
              (setq file-name-handler-alist default-file-name-handler-alist)
              ))
  ;; (setq gc-cons-threshold (* 2 1000 1000))
#+end_src
