init.el

(use-package buffer-move
  :bind (("C-c b l" . buf-move-right)
         ("C-c b j" . buf-move-left)
         ("C-c b i" . buf-move-up)
         ("C-c b k" . buf-move-down)))

(use-package dashboard
  :demand t
  ;; :after page-break-lines
  :config
  (setq line-move-visual nil)
  (setq dashboard-startup-banner 'logo)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-center-content nil)
  (setq dashboard-projects-backend 'project-el)
  (setq dashboard-items '((agenda . 6)
                          (projects . 7)
                          (recents . 7)
                          ;; (bookmarks . 3)
                          ))
  (setq dashboard-page-separator "\n\f\n")
  (setq dashboard-agenda-sort-strategy '(time-up))
  (setq dashboard-agenda-time-string-format "%b %d %Y %a ")
  (dashboard-setup-startup-hook))

(use-package page-break-lines
  :demand t
  :config (page-break-lines-mode))

(use-package savehist
  :after counsel
  :init
  (savehist-mode 1)
  (setq history-length 25))

;; Set Garbage collection threshold back down after startup completes
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 2 1000 1000))
            (setq file-name-handler-alist default-file-name-handler-alist)))
;; (setq gc-cons-threshold (* 2 1000 1000))
